<?php

namespace Database\Seeders\admin;


use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Spatie\Permission\Models\Role;

class PermissionsRolesSeeder extends Seeder
{
    public function run()
    {
        $permissions = [

            'لوحة القيادة' => [
                'لوحة القيادة الرئيسية'
            ],

            'إدارة المستخدمين' => [
                'المستخدمين',
                'إضافة مستخدم',
                'تعديل مستخدم',
                'حذف مستخدم',
                'تغيير حالة المستخدم',
            ],

            'إدارة الباقات' => [
                'الباقات',
                'إضافة باقة',
                'تعديل باقة',
                'حذف باقة',
            ],


            'إدارة الكوبونات' => [
                'الكوبونات',
                'إضافة كوبون',
                'تعديل كوبون',
                'حذف كوبون',
            ],

            'إدارة الإشتراكات' => [
                'الإشتراكات',
                'إضافة إشتراك',
                'تعديل إشتراك',
                'حذف إشتراك',
            ],

            'إدارة المعاملات المالية' => [
                'المعاملات المالية',
            ],

            'إدارة التذاكر والدعم الفني' => [
                'التذاكر',
                'عرض تذكرة',
                'الرد على تذكرة',
            ],

            'إدارة العملاء' => [
                'العملاء',
                'إضافة عميل',
                'تعديل عميل',
                'حذف عميل',
            ],


            'إدارة الإصدارات' => [
                'الإصدارات',
                'إضافة إصدارة',
                'تعديل إصدارة',
                'حذف إصدارة',
            ],

            'إدارة فريق إختبار الإصدارات' => [
                'فريق إختبار الإصدارات',
                'إضافة عضو',
                'تعديل عضو',
                'حذف عضو',
            ],

            'إدارة النظام' => [
                'إعدادات النظام',
                'المجموعات',
                'الانظمة الامنية',
                'إضافة دور',
                'تعديل دور',
                'حذف دور',
                'إسناد دور لمستخدم',
                'سجل النشاطات',

                'إعدادات اسعار الامتدادات',
                'إعدادات البنوك',
            ],

        ];


        foreach ($permissions as $section => $perms) {
            foreach ($perms as $perm) {
                Permission::firstOrCreate([
                    'name'          => $perm,
                    'section'       => $section,
                    'guard_name'    => 'admin',
                ]);
            }
        }
        $roleSuperAdmin = Role::firstOrCreate(
            [
                'name'             => 'SuperAdmin',
                'guard_name'        => 'admin'
            ]
        );

        $roleSuperAdmin->syncPermissions(Permission::all());
    }
}
