<?php

namespace Database\Seeders\tenant;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Spatie\Permission\Models\Role;

//
// class PermissionsRolesSeeder extends Seeder
// {
//     public function run()
//     {
//         $permissions = [

//             'لوحة القيادة' => [
//                 'لوحة تحكم الإدارة'
//             ],


//             'إدارة الفواتير' => [
//                 'الفواتير',
//                 'دفع فاتورة'
//             ],

//             'إعدادات الدومين' => [
//                 'حجز دومين',
//                 'ربط دومين',
//                 'نقل دومين',
//             ],

//             'مركز العمليات' => [
//                 'الشركات',
//                 'إضافة شركة',
//                 'تعديل شركة',
//                 'حذف شركة',

//                 'العقود',
//                 'إضافة عقد',
//                 'تعديل عقد',
//                 'حذف عقد',


//                 'المحافظ',
//                 'إضافة محفظة',
//                 'تعديل محفظة',
//                 'حذف محفظة',

//                 'العملاء',
//                 'عملائي',

//                 'توزيع العملاء',
//                 'إضافة توزيع',
//                 'حذف توزيع',
//                 'طلبات تحديث البيانات',


//                 'إضافة عميل',
//                 'تعديل عميل',
//                 'تعديل جميع العملاء',
//                 'حذف عميل',
//                 'حذف جميع العملاء',
//                 'تحديث مباشر للبيانات',
//                 'تصدير أكسل',
//                 'إرسال رسالة',

//                 'تفاصيل العميل',
//                 'متابعة العميل',
//                 'إضافة متابعة',
//                 'تعديل متابعة',
//                 'حذف متابعة',
//                 // 'تفاصيل السداد',
//                 'خطة سداد',
//                 'طلبات التسوية',
//                 'ملاحظات',
//                 'المرفقات',
//                 'إضافة رقم هاتف',

//                 'إعتماد',
//                 'رفض',

//                 'طلبات تحديث البيانات',
//                 'اعتماد طلب تحديث',
//                 'رفض طلب تحديث',

//                 'المستخدمين',
//                 'إضافة مستخدم',
//                 'تعديل مستخدم',
//                 'حذف مستخدم',
//             ],
//             'إدارة التحصيل' => [

//                 'أهداف التحصيل',
//                 'إضافة هدف',
//                 'حذف هدف',
//                 'تعديل هدف',

//                 'تحصيلاتي',
//                 'إضافة تحصيل',
//                 'تعديل تحصيل',
//                 'حذف تحصيل',
//                 'إعتماد تحصيل',
//                 'رفض تحصيل',

//                 'تحصيلات المستخدمين',
//                 'إعتماد تحصيل',
//                 'رفض تحصيل',
//                 'إعتماد الكل',
//                 'رفض الكل',
//                 'حذف المحدد',
//                 'استيراد التحصيلات',
//             ],
//             'إدارة النظام' => [
//                 'إعدادات النظام',
//                 'نماذج الرسائل',
//                 'قائمة الفروع',
//                 'قائمة الفئات',
//                 'قائمة الدول',
//                 'طرق التحصيل',
//                 'حالات العميل',
//                 'نتائج الاتصال',   /// new
//                 'وسائل الاتصال بالعميل',
//                 'سجل النشاطات',
//                 'سجل الرسائل',
//                 'الانظمة الامنية',
//                 'إضافة دور',
//                 'تعديل دور',
//                 'حذف دور',
//                 'إسناد دور لمستخدم',
//             ],
//             'التفارير والأرشيف' => [
//                 'تقارير العملاء',
//                 'تقارير التحصيل',
//                 'تقارير المستخدمين',
//                 'أرشيف الشركات',
//                 'أرشيف المحافظ',
//                 'أرشيف العملاء',
//                 'أرشيف العقود',
//                 'أرشيف المستخدمين',
//                 'إسترجاع السجلات',
//                 'حذف نهائي للسجلات',
//             ]

//         ];


//         foreach ($permissions as $section => $perms) {
//             foreach ($perms as $perm) {
//                 Permission::firstOrCreate([
//                     'name'          => $perm,
//                     'section'       => $section,
//                     'guard_name'    => 'tenant'
//                 ]);
//             }
//         }
//         $roleAdmin = Role::firstOrCreate(
//             [
//                 'name'          => 'Admin',
//                 'guard_name'    => 'tenant'
//             ]
//         );
//         $roleAdmin->syncPermissions(Permission::all());
//     }
// }
